Documents/ЗагрузкаКамеры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>ЗагрузкаКамеры</Name>
			<BasedOn>
				<xr:Item>Document.НачалоТермообработки</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КамераТермообработки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КамерыТермообработки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодПрограмма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодПрограммыТермообработки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗагруженаЧасы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗагруженаМинуты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗанятаМинуты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.НачалоТермообработки</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗагрузкаКамеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвободнаДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвободнаЧасы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвободнаМинуты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьНеоконченыеПроцессы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксЧасы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксМинуты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МинДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МинЧасы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МинМинуты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИтогРамПоДокументу</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТМЦ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТМЦ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидРамы</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыРам</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Кво</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>14</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КвоРам</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>14</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтчетПроизводства</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ОтчетПроизводстваЗаСмену</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачалоТермообработки</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.НачалоТермообработки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ЗагрузкаКамеры/Forms/ФормаДокументаУФ/Ext/Form/Module.bsl
// Модуль формы документа ЗагрузкаКамеры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбновитьДекорации();
КонецПроцедуры // ПриСозданииНаСервере // + claude

&НаСервере
Процедура ОбновитьДекорации()
	// К-во рам в камере
	Если ЗначениеЗаполнено(Объект.КамераТермообработки) Тогда
		Элементы.КвоРамВКамере.Заголовок = "К-во рам в камере: " + Формат(Объект.КамераТермообработки.КоличествоРам, "ЧДц=0");
	Иначе
		Элементы.КвоРамВКамере.Заголовок = "К-во рам в камере: 0";
	КонецЕсли;

	// Итого к-во ТМЦ
	ИтогоКво = 0;
	Для Каждого Строка Из Объект.ТМЦ Цикл
		ИтогоКво = ИтогоКво + Строка.Кво;
	КонецЦикла;
	Элементы.ИтогоКвоТекст.Заголовок = "Итого к-во: " + Формат(ИтогоКво, "Ч12.2");

	// Итого рам + предупреждение о превышении
	Элементы.ТекстМногоРам.Заголовок = ВернутьКвоРам();
КонецПроцедуры // ОбновитьДекорации // + claude

&НаСервере
Функция ВернутьКвоРам()
	ТЗ = Объект.ТМЦ.Выгрузить();
	ТЗ.Свернуть("ВидРамы", "КвоРам");
	КвоРамИтого = 0;
	Для Каждого Строка Из ТЗ Цикл
		КвоРамИтого = КвоРамИтого + Строка.КвоРам;
	КонецЦикла;

	Если ЗначениеЗаполнено(Объект.КамераТермообработки)
		И Объект.КамераТермообработки.КоличествоРам > 0
		И КвоРамИтого > Объект.КамераТермообработки.КоличествоРам Тогда
		Возврат "Превышено кол-во рам в камере!!!";
	КонецЕсли;

	Возврат "Итого к-во рам: " + Формат(КвоРамИтого, "ЧДц=0");
КонецФункции // ВернутьКвоРам // + claude

&НаКлиенте
Процедура КамераТермообработкиПриИзменении(Элемент)
	КамераТермообработкиПриИзменении_НаСервере();
КонецПроцедуры // КамераТермообработкиПриИзменении // + claude

&НаСервере
Процедура КамераТермообработкиПриИзменении_НаСервере()
	ОбновитьДекорации();
КонецПроцедуры // КамераТермообработкиПриИзменении_НаСервере // + claude

&НаКлиенте
Процедура ПодПрограммаПриИзменении(Элемент)
	ПодПрограммаПриИзменении_НаСервере();
КонецПроцедуры // ПодПрограммаПриИзменении // + claude

&НаСервере
Процедура ПодПрограммаПриИзменении_НаСервере()
	// Пересчитываем время освобождения камеры
	РассчитатьВремяОсвобождения_НаСервере();

	// Очищаем камеру если подпрограмма выполняется вне камеры
	Если ЗначениеЗаполнено(Объект.ПодПрограмма) И Объект.ПодПрограмма.ВнеКамеры Тогда
		Объект.КамераТермообработки = Справочники.КамерыТермообработки.ПустаяСсылка();
	КонецЕсли;

	ОбновитьДекорации();
КонецПроцедуры // ПодПрограммаПриИзменении_НаСервере // + claude

&НаСервере
Процедура РассчитатьВремяОсвобождения_НаСервере()
	Если НЕ ЗначениеЗаполнено(Объект.ПодПрограмма) Тогда
		Возврат;
	КонецЕсли;

	// ДлинаПроцесса хранится в минутах
	ТекМинутПрограммы = 0;
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЕСТЬNULL(СУММА(ПроцессПодПрограммыТермообработки.ДлинаПроцесса), 0) КАК ТекМинутПрограммы
		|ИЗ
		|	Справочник.ПроцессПодПрограммыТермообработки КАК ПроцессПодПрограммыТермообработки
		|ГДЕ
		|	ПроцессПодПрограммыТермообработки.Владелец = &ПодПрограмма
		|	И НЕ ПроцессПодПрограммыТермообработки.ПометкаУдаления";
	Запрос.УстановитьПараметр("ПодПрограмма", Объект.ПодПрограмма);
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
		ТекМинутПрограммы = Результат.ТекМинутПрограммы;
	КонецЕсли; // выборка суммы длительности // + claude

	Объект.ЗанятаМинуты = ТекМинутПрограммы;

	// Рассчитываем дату и время освобождения камеры
	ОбщоМинут             = (Объект.ЗагруженаЧасы * 60) + Объект.ЗагруженаМинуты + Объект.ЗанятаМинуты;
	Объект.СвободнаДата   = Объект.Дата + Цел(ОбщоМинут / 1440);
	ОстатокМинут          = ОбщоМинут - Цел(ОбщоМинут / 1440) * 1440;
	Объект.СвободнаЧасы  = Цел(ОстатокМинут / 60);
	Объект.СвободнаМинуты = ОстатокМинут - Цел(ОстатокМинут / 60) * 60;

КонецПроцедуры // РассчитатьВремяОсвобождения_НаСервере // + claude

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	// Суммируем итоговое к-во рам по документу
	КвоРамИтого = 0;
	Для Каждого Строка Из ТекущийОбъект.ТМЦ Цикл
		КвоРамИтого = КвоРамИтого + Строка.КвоРам;
	КонецЦикла;
	ТекущийОбъект.ИтогРамПоДокументу = КвоРамИтого;
КонецПроцедуры // ПередЗаписьюНаСервере // + claude

// Печать терможурнала по текущему документу.
// Аналог Печать() формы УМК_ЗагрузкаКамеры 1С77: запись документа и
// открытие обработки УМК_ПечатьТерможурнала со списком документов. // + claude
&НаКлиенте
Процедура ПечатьТерможурнала(Команда)

	// 1С77 выполнял Записать() перед печатью
	Если Модифицированность Или НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Если НЕ Записать() Тогда
			Возврат;
		КонецЕсли; // запись не выполнена
	КонецЕсли; // документ не записан

	СписокДокументов = Новый Массив;
	СписокДокументов.Добавить(Объект.Ссылка);

	ПараметрыФормы = Новый Структура("СписокДокументов", СписокДокументов);
	ОткрытьФорму("Обработка.ПечатьТерможурнала.Форма.ФормаУФ", ПараметрыФормы, ЭтаФорма);

КонецПроцедуры // ПечатьТерможурнала // + claude

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	// Обновляем поля документа-основания НачалоТермообработки
	Если ЗначениеЗаполнено(ТекущийОбъект.ДокументОснование) Тогда
		ДокОснование = ТекущийОбъект.ДокументОснование.ПолучитьОбъект();
		ДокОснование.НачалоЧасы     = ТекущийОбъект.ЗагруженаЧасы;
		ДокОснование.НачалоМинуты   = ТекущийОбъект.ЗагруженаМинуты;
		ДокОснование.ДокументЗагрузка = ТекущийОбъект.Ссылка;
		ДокОснование.Записать(РежимЗаписиДокумента.Запись);
	КонецЕсли;
КонецПроцедуры // ПослеЗаписиНаСервере // + claude
